Repository: thomasboom/Alex
Catalog: lib/l10n/app_*.arb
Languages: es, nl

source: Welcome Back
es: Bienvenido de nuevo
nl: Welkom Terug

# enterPinSubtitle
source: Enter your PIN to access the app
es: Ingrese su PIN para acceder a la aplicación
nl: Voer uw PIN in om toegang te krijgen tot de app

# incorrectPin
source: Incorrect PIN. Please try again.
es: PIN incorrecto. Por favor, inténtelo de nuevo.
nl: Onjuiste PIN. Probeer het opnieuw.

source: Settings
es: Configuración
nl: Instellingen

source: Appearance
es: Apariencia
nl: Uiterlijk

source: Color Palette
es: Paleta de colores
nl: Kleurenpalet

source: Primary Color
es: Color principal
nl: Hoofdkleur

# chooseColorTheme
source: Choose the main color theme for the app
es: Elija el tema de color principal de la aplicación
nl: Kies het hoofdkleurenschema voor de app

source: API Configuration
es: Configuración de API
nl: API Configuratie

source: API Key Source
es: Fuente de clave API
nl: API Sleutelbron

# chooseApiKeySource
source: Choose whether to use the inbuilt API key or provide your own custom key
es: Elija si desea usar la clave API incorporada o proporcionar su propia clave personalizada
nl: Kies of u de ingebouwde API-sleutel wilt gebruiken of uw eigen aangepaste sleutel opgeven

# inbuiltApiKeyWarning
source: ⚠️ Inbuilt API key will hit rate limits much sooner. Custom keys provide higher limits and better performance.
es: ⚠️ La clave API incorporada alcanzará los límites de velocidad mucho antes. Las claves personalizadas proporcionan límites más altos y mejor rendimiento.
nl: ⚠️ De ingebouwde API-sleutel raakt sneller de limieten. Aangepaste sleutels bieden hogere limieten en betere prestaties.

source: Inbuilt API Key
es: Clave API incorporada
nl: Ingebouwde API-sleutel

# usePreconfiguredKey
source: Use the pre-configured API key
es: Usar la clave API preconfigurada
nl: Gebruik de vooraf geconfigureerde API-sleutel

source: Custom API Key
es: Clave API personalizada
nl: Aangepaste API-sleutel

# customKeyConfigured
source: Custom key is configured
es: Clave personalizada configurada
nl: Aangepaste sleutel is geconfigureerd

# enterOwnApiKey
source: Enter your own API key
es: Ingrese su propia clave API
nl: Voer uw eigen API-sleutel in

source: Security
es: Seguridad
nl: Beveiliging

source: PIN Lock
es: Bloqueo con PIN
nl: PIN-slot

# pinLockEnabledDesc
source: App is protected with a PIN code
es: La aplicación está protegida con un código PIN
nl: App is beveiligd met een PIN-code

# pinLockDisabledDesc
source: Secure your app with a 4-digit PIN
es: Proteja su aplicación con un PIN de 4 dígitos
nl: Beveilig uw app met een 4-cijferige PIN

source: Change PIN
es: Cambiar PIN
nl: PIN wijzigen

source: Data Management
es: Gestión de datos
nl: Gegevensbeheer

source: Export Conversations
es: Exportar conversaciones
nl: Gesprekken exporteren

# exportConversationsDesc
source: Export your conversation history to a plain text file for backup or sharing.
es: Exporte su historial de conversaciones a un archivo de texto para copia de seguridad o compartir.
nl: Exporteer uw gespreksgeschiedenis naar een tekstbestand voor back-up of delen.

source: Export to Plain Text
es: Exportar a texto plano
nl: Exporteren naar platte tekst

source: Export to JSON
es: Exportar a JSON
nl: Exporteren naar JSON

source: Clear Data
es: Borrar datos
nl: Gegevens wissen

# clearDataWarning
source: Permanently delete Alex, including all conversation history and memories. This action cannot be undone.
es: Elimine permanentemente Alex, incluyendo todo el historial de conversaciones y recuerdos. Esta acción no se puede deshacer.
nl: Wis Alex permanent, inclusief alle gespreksgeschiedenis en herinneringen. Deze actie kan niet ongedaan worden gemaakt.

source: Permanently Delete Alex
es: Eliminar permanentemente Alex
nl: Alex permanent verwijderen

source: Theme Preference
es: Preferencia de tema
nl: Themavoorkeur

# chooseThemeDesc
source: Choose how the app looks and feels
es: Elija cómo se ve y se siente la aplicación
nl: Kies hoe de app eruitziet en aanvoelt

source: System
es: Sistema
nl: Systeem

source: Follow system theme
es: Seguir el tema del sistema
nl: Volg systeemthema

source: Light
es: Claro
nl: Licht

# alwaysLightTheme
source: Always use light theme
es: Usar siempre el tema claro
nl: Altijd licht thema gebruiken

source: Dark
es: Oscuro
nl: Donker

# alwaysDarkTheme
source: Always use dark theme
es: Usar siempre el tema oscuro
nl: Altijd donker thema gebruiken

# permanentlyDeleteConfirmTitle
source: Permanently Delete Alex?
es: ¿Eliminar permanentemente Alex?
nl: Alex permanent verwijderen?

# permanentlyDeleteConfirmDesc
source: This action cannot be undone. Alex and all conversation history will be permanently deleted.
es: Esta acción no se puede deshacer. Alex y todo el historial de conversaciones se eliminará permanentemente.
nl: Deze actie kan niet ongedaan worden gemaakt. Alex en alle gespreksgeschiedenis worden permanent verwijderd.

source: Cancel
es: Cancelar
nl: Annuleren

source: Delete Permanently
es: Eliminar permanentemente
nl: Permanent verwijderen

# alexDeletedSuccess
source: Alex permanently deleted. All memories and conversation history removed.
es: Alex eliminado permanentemente. Todos los recuerdos e historial de conversaciones eliminados.
nl: Alex permanent verwijderd. Alle herinneringen en gespreksgeschiedenis verwijderd.

# deleteFailed
source: Failed to permanently delete Alex. Please try again.
es: No se pudo eliminar permanentemente Alex. Por favor, inténtelo de nuevo.
nl: Kon Alex niet permanent verwijderen. Probeer het opnieuw.

# exportSuccess
source: Conversations exported successfully
es: Conversaciones exportadas exitosamente
nl: Gesprekken succesvol geëxporteerd

# exportJSONSuccess
source: Conversations exported to JSON successfully
es: Conversaciones exportadas exitosamente a JSON
nl: Gesprekken succesvol geëxporteerd naar JSON

# exportFailed
source: Failed to export conversations. Please try again.
es: No se pudieron exportar las conversaciones. Por favor, inténtelo de nuevo.
nl: Kon gesprekken niet exporteren. Probeer het opnieuw.

source: Save Exported Conversations
es: Guardar conversaciones exportadas
nl: Geëxporteerde gesprekken opslaan

source: Save Exported Conversations (JSON)
es: Guardar conversaciones exportadas (JSON)
nl: Geëxporteerde gesprekken opslaan (JSON)

source: Set PIN Lock
es: Establecer bloqueo con PIN
nl: PIN-slot instellen

# enterPinToSecure
source: Enter a 4-digit PIN to secure your app
es: Ingrese un PIN de 4 dígitos para asegurar su aplicación
nl: Voer een 4-cijferige PIN in om uw app te beveiligen

source: New PIN
es: Nuevo PIN
nl: Nieuwe PIN

source: Confirm PIN
es: Confirmar PIN
nl: PIN bevestigen

source: Set PIN
es: Establecer PIN
nl: PIN instellen

# pinLockEnabledSuccess
source: PIN lock enabled successfully
es: Bloqueo con PIN habilitado exitosamente
nl: PIN-slot succesvol ingeschakeld

source: Disable PIN Lock?
es: ¿Desactivar bloqueo con PIN?
nl: PIN-slot uitschakelen?

# disablePinLockDesc
source: Are you sure you want to disable PIN lock? Your app will no longer require a PIN to access.
es: ¿Está seguro de que desea desactivar el bloqueo con PIN? Su aplicación ya no requerirá un PIN para acceder.
nl: Weet u zeker dat u het PIN-slot wilt uitschakelen? Uw app vereist geen PIN meer voor toegang.

# pinLockDisabledSuccess
source: PIN lock disabled
es: Bloqueo con PIN desactivado
nl: PIN-slot uitgeschakeld

source: Disable
es: Desactivar
nl: Uitschakelen

source: Current PIN
es: PIN actual
nl: Huidige PIN

source: Confirm New PIN
es: Confirmar nuevo PIN
nl: Nieuwe PIN bevestigen

# pinChangedSuccess
source: PIN changed successfully
es: PIN cambiado exitosamente
nl: PIN succesvol gewijzigd

# customApiKeyLabel
source: Custom API Key
es: Clave API personalizada
nl: Aangepaste API-sleutel

# enterCustomApiKeyDesc
source: Enter your custom Ollama API key. You can get one from https://ollama.com/settings/keys
es: Ingrese su clave API personalizada de Ollama. Puede obtener una en https://ollama.com/settings/keys
nl: Voer uw aangepaste Ollama API-sleutel in. U kunt er een krijgen op https://ollama.com/settings/keys

# apiKeySecurityNote
source: 🔒 Your API key is stored securely on your device only and is never transmitted to our servers.
es: 🔒 Su clave API se almacena de forma segura solo en su dispositivo y nunca se transmite a nuestros servidores.
nl: 🔒 Uw API-sleutel wordt veilig alleen op uw apparaat opgeslagen en wordt nooit naar onze servers verzonden.

source: API Key
es: Clave API
nl: API-sleutel

# enterApiKey
source: Enter your API key...
es: Ingrese su clave API...
nl: Voer uw API-sleutel in...

# enterModelDesc
source: Enter the Ollama model to use (e.g., llama3, mistral)
es: Ingrese el modelo Ollama a usar (ej. llama3, mistral)
nl: Voer het Ollama-model in dat u wilt gebruiken (bijv. llama3, mistral)

# modelPlaceholder
source: e.g. llama3
es: ej. llama3
nl: bijv. llama3

source: API Endpoint
es: Punto final de API
nl: API-eindpunt

# enterEndpointDesc
source: Enter the Ollama API endpoint URL
es: Ingrese la URL del punto final de la API de Ollama
nl: Voer de URL van het Ollama API-eindpunt in

source: API endpoint updated
nl: API-eindpunt bijgewerkt

source: Enter PIN
es: Ingresar PIN
nl: PIN invoeren

# enterPinToContinue
source: Please enter your 4-digit PIN to continue
es: Por favor, ingrese su PIN de 4 dígitos para continuar
nl: Voer uw 4-cijferige PIN in om door te gaan

source: Use Different Method
es: Usar método diferente
nl: Gebruik een andere methode

source: Type a message...
es: Escribe un mensaje...
nl: Typ een bericht...

# chatEmpty
source: How can I help you today?
es: ¿Cómo puedo ayudarte hoy?
nl: Hoe kan ik u vandaag helpen?

# welcomeMessage
source: Hey, whatsup?
es: ¿Qué tal?
nl: Hé, hoe is het?

# placeholderText
source: What's on your mind?
es: ¿Qué tienes en mente?
nl: Wat heb je in gedachten?

source: Language
es: Idioma
nl: Taal

# chooseLanguage
source: Choose your preferred language
es: Elige tu idioma preferido
nl: Kies uw voorkeurstaal

source: English
es: Inglés
nl: Engels

source: Dutch
es: Holandés
nl: Nederlands

source: Spanish
es: Español
nl: Spaans

source: French
es: Francés
nl: Frans

# colorBlue
source: Blue
es: Azul
nl: Blauw

# colorPurple
source: Purple
es: Púrpura
nl: Paars

# colorGreen
source: Green
es: Verde
nl: Groen

# colorOrange
source: Orange
es: Naranja
nl: Oranje

# colorPink
source: Pink
es: Rosa
nl: Roze

# colorTeal
source: Teal
es: Turquesa
nl: Groenblauw

# colorCyan
source: Cyan
nl: Cyaan

# colorLime
source: Lime
nl: Limoen

# colorBrown
source: Brown
nl: Bruin

# colorDeepPurple
source: Deep Purple
nl: Donkerpaars

# colorDeepOrange
source: Deep Orange
nl: Donkeroranje

# colorLightBlue
source: Light Blue
nl: Lichtblauw

# colorYellow
source: Yellow
nl: Geel

source: Model
es: Modelo

# colorIndigo
source: Indigo
es: Índigo
